package com.company.java013_total;
/*
Q8.	 |	   abstract 		vs		     interface
-----------------------------------------------------------
     | 둘다 설계가 가능한 클래스
-----------------------------------------------------------
공통점 | 자식객체를 통해서 코드를 구현
-----------------------------------------------------------
차이점 |	추상화 정도가 interface가 더 크다. 			        
-----------------------------------------------------------
abstract   - 인스턴스변수, 인스턴스메서드 사용가능
interface  - 상수(public static final), abstracat메서드
-----------------------------------------------------------

*/


////////////////////////////////////////////////////////////
public class Repeat008 {
	public static void main(String[]args) {
		
	}
}
////////////////////////////////////////////////////////////
